Public Member Functions | Friends | List of all members
IFCAPI::Attribute Class Referencefinal
IFC Data Access
Represents an IFC Attribute. More...
#include <IFCAttribute.hpp>
 Inheritance diagram for IFCAPI::Attribute:
 Public Member Functions
GS::UniString  | GetName () const
Name of the Attribute.
std::optional< GS::UniString >  | GetValue () const
Value of the Attribute.
IFCAPI::IFCType  | GetValueType () const
Value type of the Attribute.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
 class  | PropertyAccessor
 class  | PropertyBuilder
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
Represents an IFC Attribute.
Since
Archicad 28